Repository: massidea/site
Catalog: application/languages/group.tmx
Source language: fi
Languages: en

source: Ryhmät
en: Groups

source: Kaikki ryhmät
en: All groups

source: Nimi
en: Name

source: Kuvaus
en: Description

source: Luo uusi ryhmä
en: Create a new group

source: Uuden ryhmän nimi
en: Name of the new group

source: Uuden ryhmän lyhyt kuvaus
en: Short description of the new group

source: Luo ryhmä
en: Create group

source: Perustettu
en: Founded

source: Ylläpitäjät
en: Administrators

source: Jäsenet
en: Members

source: Liity
en: Join

source: Liity tähän ryhmään
en: Join this group

source: Poistu
en: Leave

source: Poistu tästä ryhmästä
en: Leave this group

source: Kommentoi
en: Comment

source: Ryhmän nimi on jo käytössä
en: Group name is already in use
